# Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. 
# Сколько журавликов сделал каждый ребенок, если известно, 
# что Петя и Сережа сделали одинаковое количество журавликов, 
# а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?

# *Пример:*

# 6 -> 1  4  1
# 24 -> 4  16  4
#     60 -> 10  40  10

num = int(input("Введите сделанное Петей,Катей и Сережей число журавликов : "))
if num % 6 == 0:

# ps = num // 3
# k = ps * 2
# pors = ps // 2 
# print (pors, k, pors)

    print(var := num // 3 // 2, var * 4, var)
else:
    print("Введите корректное число журавликов")