# Задача 6: Вы пользуетесь общественным транспортом? 
# Вероятно, вы расплачивались за проезд и получали билет с номером. 
# Счастливым билетом называют такой билет с шестизначным номером, 
# где сумма первых трех цифр равна сумме последних трех. Т.е. билет с номером 385916 – счастливый, 
# т.к. 3+8+5=9+1+6. Вам требуется написать программу, которая проверяет счастливость билета.

# *Пример:*

# 385916 -> yes
# 123456 -> no

ticket = input("Введите номер билета: ")

if len(ticket) != 6 or not ticket.isdigit():
    print("Такого билета не существует")
else:
    first_number = sum(map(int, ticket[:3]))
    second_number = sum(map(int, ticket[3:]))
    if first_number == second_number:
        print("Счастливый билет!")
    else:
         print("всё как в меме, когда два парня в шапках смотрят на тебя")

# для использования функции map использовал сайт https://ru.stackoverflow.com/, нашел примеры по запросу как разбить число на состовляющие, 
# на удивление была такая же задача "https://ru.stackoverflow.com/questions/506457/%D0%A0%D0%B0%D0%B7%D0%B1%D0%B8%D1%82%D1%8C-%D1%87%D0%B8%D1%81%D0%BB%D0%BE-%D0%BD%D0%B0-%D1%81%D0%BE%D1%81%D1%82%D0%B0%D0%B2%D0%BB%D1%8F%D1%8E%D1%89%D0%B8%D0%B5"