# Задача 18: Требуется найти в массиве A[1..N] самый близкий по величине элемент к заданному числу X. 
# Пользователь в первой строке вводит натуральное число N – количество элементов в массиве. 
# В последующих  строках записаны N целых чисел Ai. Последняя строка содержит число X

# *Пример:*

# 5
#     1 2 3 4 5
#     6
#     -> 5

import random

n = int(input("Введите длину массива: "))
a = [random.randint(-10, n) for i in range(n)]
x = int(input("Введите число от которого будем искать: "))

min_index = 0
for i in range(n):
    if abs(a[i] - x) < abs(a[min_index] - x):
        min_index = i

print(*a)

print()
print(f"Ближайшее значение к числу {x}: {a[min_index]}")